# Stadius Move Luxembourg 🚌
# Last modified in November 2022

from selenium.common.exceptions import NoSuchElementException
from selenium import webdriver
from selenium.webdriver.support.ui import WebDriverWait
from selenium.webdriver.support import expected_conditions as EC
from selenium.webdriver.common.keys import Keys
from selenium.webdriver.common.by import By
from selenium.common.exceptions import TimeoutException
import selenium
import time
import re
import csv
import datetime
import time
import tweepy

# Twitter connection part :

client = tweepy.Client(consumer_key="consumer_key",
                    consumer_secret="consumer_secret",
                    access_token="access_token",
                    access_token_secret="access_token_secret", wait_on_rate_limit=True)
auth = tweepy.OAuthHandler("consumer_key", "consumer_secret")
auth.set_access_token("access_token", "access_token_secret")
api = tweepy.API(auth)

# Lux traffic info database

base = "./Stadius Move/base_lux.csv"
with open(base , "r") as fichier:
    lecteur = csv.reader(fichier)
    tab_trafic = [ligne for ligne in lecteur]

# Lux users database

user_base = "./Stadius Move/user_lux.csv"
with open(user_base , "r") as fichier:
    lecteur = csv.reader(fichier)
    tab_user = [ligne for ligne in lecteur]

# There are several inconsistencies that have not been corrected at this level

lignes_reseau = ['A10', 'A11', 'A12', 'A13', 'A14', 'A15', 'A16', 'A17', 'A18', 'A19', 'A20', 'A21', 'A22', 'A23', 'A24', 'A25', 'A26', 'A27', 'A28', 'A29', 'A30', 'A31', 'A32', 'A33', 'A34', 'A35', 'A36', 'A37', 'A38', 'A39', 'A40', 'A41', 'A42', 'A43', 'A44', 'A45', 'A46', 'A47', 'A48', 'A49', 'A50', 'A51', 'A52', 'A53', 'A54', 'A55', 'A56', 'A57', 'A58', 'A59', 'A60', 'A61', 'A62', 'A63', 'A64', 'A65', 'A66', 'A67', 'A68', 'A69', 'A70', 'A71', 'A72', 'A73', 'A74', 'A75', 'A76', 'A77', 'A78', 'A79', 'A80', 'A81', 'A82', 'A83', 'A84', 'A85', 'A86', 'A87', 'A88', 'A89', 'A90', 'A91', 'A92', 'A93', 'A94', 'A95', 'A96', 'A97', 'A98', 'A99', 'B01', 'B02', 'B03', 'B04', 'B05', 'B06', 'B07', 'B08', 'B09', 'B10', 'C02', 'C03', 'C05', 'C06', 'C07', 'C08', 'C09', 'C10', 'C11', 'C12', 'D06', 'E07', 'H05', 'H04', 'B04', 'L07', 'JU5', 'N03', 'K21', '01U', '02U', '03U', '04U', '05U', '06U', '07U', '08U', '09U', '10U', '11U', '12U', '13U', '14U', '15U', '16U', '17U', '18U', '19U', '20U', '21U', '22U', '23U', '24U', '25U', '26U', '27U', '28U', '29U', '30U', '31U', '32U', '33U', '34U', '35U', '36U', '37U', '38U', '39U', '40U', '41U', '42U', '43U', '44U', '45U', '46U', '47U', '48U', '49U', '50U', '51U', '52U', '53U', '54U', '55U', '56U', '57U', '58U', '59U', '60U', '61U', '62U', '63U', '64U', '65U', '66U', '67U', '68U', '69U', '70U', '71U', '72U', '73U', '74U', '75U', '76U', '77U', '78U', '79U', '80U', '81U', '82U', '83U', '84U', '85U', '86U', '87U', '88U', '89U', '90U', '91U', '92U', '93U', '94U', '95U', '96U', '97U', '98U', '99U','K10', 'K11', 'K12', 'K13', 'K14', 'K15', 'K16', 'K17', 'K18', 'K19', 'K20', 'K21', 'K22', 'K23', 'K24', 'K25', 'K26', 'K27', 'K28', 'K29', 'K30', 'K31', 'K32', 'K33', 'K34', 'K35', 'K36', 'K37', 'K38', 'K39', 'K40', 'K41', 'K42', 'K43', 'K44', 'K45', 'K46', 'K47', 'K48', 'K49', 'K50', 'K51', 'K52', 'K53', 'K54', 'K55', 'K56', 'K57', 'K58', 'K59', 'K60', 'K61', 'K62', 'K63', 'K64', 'K65', 'K66', 'K67', 'K68', 'K69', 'K70', 'K71', 'K72', 'K73', 'K74', 'K75', 'K76', 'K77', 'K78', 'K79', 'K80', 'K81', 'K82', 'K83', 'K84', 'K85', 'K86', 'K87', 'K88', 'K89', 'K90', 'K91', 'K92', 'K93', 'K94', 'K95', 'K96', 'K97', 'K98', 'K99', 'E01','0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30', '31', '32', '33', '34', '35', '36', '37', '38', '39', '40', '41', '42', '43', '44', '45', '46', '47', '48', '49', '50', '51', '52', '53', '54', '55', '56', '57', '58', '59', '60', '61', '62', '63', '64', '65', '66', '67', '68', '69', '70', '71', '72', '73', '74', '75', '76', '77', '78', '79', '80', '81', '82', '83', '84', '85', '86', '87', '88', '89', '90', '91', '92', '93', '94', '95', '96', '97', '98', '99', '100','101','102','103','104','105','106','107','108','109','110','111','112','113','114','115','116','117','118','119','120','121','122','123','124','125','126','127','128','129','130','131','132','133','134','135','136','137','138','139','140','141','142','143','144','145','146','147','148','149','150','151','152','153','154','155','156','157','158','159','160','161','162','163','164','165','166','167','168','169','170','171','172','173','174','175','176','177','178','179','180','181','182','183','184','185','186','187','188','189','190','191','192','193','194','195','196','197','198','199','200','201','202','203','204','205','206','207','208','209','210','211','212','213','214','215','216','217','218','219','220','221','222','223','224','225','226','227','228','229','230','231','232','233','234','235','236','237','238','239','240','241','242','243','244','245','246','247','248','249','250','251','252','253','254','255','256','257','258','259','260','261','262','263','264','265','266','267','268','269','270','271','272','273','274','275','276','277','278','279','280','281','282','283','284','285','286','287','288','289','290','291','292','293','294','295','296','297','298','299','300','301','302','303','304','305','306','307','308','309','310','311','312','313','314','315','316','317','318','319','320','321','322','323','324','325','326','327','328','329','330','331','332','333','334','335','336','337','338','339','340','341','342','343','344','345','346','347','348','349','350','351','352','353','354','355','356','357','358','359','360','361','362','363','364','365','366','367','368','369','370','371','372','373','374','375','376','377','378','379','380','381','382','383','384','385','386','387','388','389','390','391','392','393','394','395','396','397','398','399','400','401','402','403','404','405','406','407','408','409','410','411','412','413','414','415','416','417','418','419','420','421','422','423','424','425','426','427','428','429','430','431','432','433','434','435','436','437','438','439','440','441','442','443','444','445','446','447','448','449','450','451','452','453','454','455','456','457','458','459','460','461','462','463','464','465','466','467','468','469','470','471','472','473','474','475','476','477','478','479','480','481','482','483','484','485','486','487','488','489','490','491','492','493','494','495','496','497','498','499','500','501','502','503','504','505','506','507','508','509','510','511','512','513','514','515','516','517','518','519','520','521','522','523','524','525','526','527','528','529','530','531','532','533','534','535','536','537','538','539','540','541','542','543','544','545','546','547','548','549','550','551','552','553','554','555','556','557','558','559','560','561','562','563','564','565','566','567','568','569','570','571','572','573','574','575','576','577','578','579','580','581','582','583','584','585','586','587','588','589','590','591','592','593','594','595','596','597','598','599','600','601','602','603','604','605','606','607','608','609','610','611','612','613','614','615','616','617','618','619','620','621','622','623','624','625','626','627','628','629','630','631','632','633','634','635','636','637','638','639','640','641','642','643','644','645','646','647','648','649','650','651','652','653','654','655','656','657','658','659','660','661','662','663','664','665','666','667','668','669','670','671','672','673','674','675','676','677','678','679','680','681','682','683','684','685','686','687','688','689','690','691','692','693','694','695','696','697','698','699','700','701','702','703','704','705','706','707','708','709','710','711','712','713','714','715','716','717','718','719','720','721','722','723','724','725','726','727','728','729','730','731','732','733','734','735','736','737','738','739','740','741','742','743','744','745','746','747','748','749','750','751','752','753','754','755','756','757','758','759','760','761','762','763','764','765','766','767','768','769','770','771','772','773','774','775','776','777','778','779','780','781','782','783','784','785','786','787','788','789','790','791','792','793','794','795','796','797','798','799','800','801','802','803','804','805','806','807','808','809','810','811','812','813','814','815','816','817','818','819','820','821','822','823','824','825','826','827','828','829','830','831','832','833','834','835','836','837','838','839','840','841','842','843','844','845','846','847','848','849','850','851','852','853','854','855','856','857','858','859','860','861','862','863','864','865','866','867','868','869','870','871','872','873','874','875','876','877','878','879','880','881','882','883','884','885','886','887','888','889','890','891','892','893','894','895','896','897','898','899','900','901','902','903','904','905','906','907','908','909','910','911','912','913','914','915','916','917','918','919','920','921','922','923','924','925','926','927','928','929','930','931','932','933','934','935','936','937','938','939','940','941','942','943','944','945','946','947','948','949','950','951','952','953','954','955','956','957','958','959','960','961','962','963','964','965','966','967','968','969','970','971','972','973','974','975','976','977','978','979','980','981','982','983','984','985','986','987','988','989','990','991','992','993','994','995','996','997','998','999']
lignes_scolaires = ['600', '650', '730', '771', '800', '821', '864', '900', '601', '651',
 '740', '772', '801', '822', '870', '901', '610', '653', '745', '773', '802', '823', '871', 
 '902', '611', '660', '750', '774', '803', '830', '875', '904', '612', '661', '751', '781', 
 '804', '835', '880', '922', '613', '662', '760', '782', '810', '840', '881', '923', '620', 
 '670', '761', '783', '811', '841', '882', '940', '621', '671', '762', '784', '812', '850', 
 '883', '971', '622', '766', '785', '813', '860', '891', '972', '630', '767', '795', '814', 
 '861', '973', '640', '768', '796', '817', '862', '641', '770', '820', '863']

# Selenium

driver = webdriver.Edge(executable_path="./Stadius Move/msedgedriver.exe")
driver.get('https://www.mobiliteit.lu/fr/informations-de-circulation/') 

info_trafic_global = []
info_trafic_local = []
info_trafic_lignes = []
nb_lignes = 0
boucle = 1

while True:
    boucle += 1
    try:
        openn = driver.find_element(By.XPATH, '//*[@id="table-roadinfo"]/li['+ str(boucle)+']/div/div[1]/div[2]/div')
        driver.execute_script("arguments[0].click();", openn)
        title = driver.find_element(By.XPATH, '//*[@id="table-roadinfo"]/li['+ str(boucle)+']/div/div[1]/div[2]/button')
        title_txt = title.text
        title_tab = title_txt.split()
        title_tab = re.split(",| | et |:", title_txt)
        lignes_local = []
        content = driver.find_element(By.XPATH, '//*[@id="table-roadinfo"]/li['+ str(boucle)+ ']/div/div[2]')
        content_txt = content.text
        for l in title_tab:
            nb_lignes += 1
            lignes_local.append(l)
        lignes_mess = ""
        for li in lignes_local:
            if lignes_mess == "":
                lignes_mess += li
            else:
                lignes_mess += ", " + li 
        message = title_txt + "\nLigne(s): "+ lignes_mess + "\nDescription: "+ content_txt
        info_trafic_local = [lignes_local, message, "n"]
        info_trafic_global.append(info_trafic_local)
    except NoSuchElementException:
        break
    except TimeoutException:
        break

tab_trafic_end = []

# Suppression of parasitic tables

for ne in tab_trafic:
    if ne == []:
        tab_trafic.remove(ne)
    elif ne == [[],"\nLigne(s):\nDescription: ", "o"]:
        tab_trafic.remove(ne)
    elif ne == [[],"\nLigne(s): \nDescription: ","o"]:
        tab_trafic.remove(ne)

for new in tab_trafic:
    if type(new[0]) is str :
        output = eval(new[0]) 
        new[0] = output

# check if the info is already done or not

cfl_tweet = []
sco_tweet = []
tab_envoi = []

for verif in info_trafic_global:
    secondd = verif
    secondd[2] = "o"
    if verif in tab_trafic or secondd in tab_trafic:
        verif[2] = "o"
        tab_trafic_end.append(verif)
    elif verif not in tab_trafic or secondd not in tab_trafic:
        tab_trafic_end.append(verif)
        tab_envoi.append(verif)
        if "CFL" in verif[1]:
            for i in verif[0]: #lignes
                if int(i) < 100:
                    cfl_tweet.append(i)
        for i in lignes_scolaires:
            if i in verif[1]:
                sco_tweet.append(i)

with open(base, 'w') as data:
    stylo = csv.writer(data)
    stylo.writerows(tab_trafic_end)

heure = time.ctime().split()
heure = heure[3]
day = datetime.date.today()

for person in tab_user:
    for ligne in person[0]:
        for new in tab_envoi:
            for li_nw in new[0]:
                if li_nw == ligne:
                    try: 
                        name = person[1]
                        user = api.get_user(screen_name=name)
                        message = "⚠ INFORMATION TRAFIC ⚠ :\nActualisation de " + str(heure) + " du " + str(day) + "\nBonjour "+ str(person[1] + ":\n\n" + new[1] + "\n\nStadius Move Luxembourg 🚌" )
                        direct_message = api.send_direct_message( user.id , message)
                    except:
                        print("A problem has occurred at the send message level")

# part CFL tweet

cfl_tweet = ", ".join(cfl_tweet)

try:
    message_tweet = "Info-trafic réseau CFL 🚂: \n➡  " + str(heure) + " du " + str(day) + "\nLigne(s): "+ cfl_tweet + "\nEnvoyez nous votre ligne pour plus d'info !\n#stadiusmove #cfl #luxembourg #infotrafic"
    status=api.update_status(message_tweet)
except:
    print("Problem tweet CFL")


sco_tweet = ", ".join(sco_tweet)
message_tweet = text = "Info-trafic réseau AVL scolaires 🚌: \n➡  " + str(heure) + " du " + str(day) + "\nLigne(s): " + sco_tweet

if len(message_tweet) < 240:
    message_tweet += "\n#stadiusmove #AVL #luxembourg #bus"
try:
    status=api.update_status(message_tweet)
except:
    print("Problem tweet sco")


"""
# tweet summary traffic info

resume_tweet = "Résumé info-trafic Stadius Move au Luxembourg 🚌\n➡ " + str(day) + "\n Nb de lignes concernés: " + str(nb_lignes) + "Nb info-trafic: " + str(boucle)
status = api.update_status(resume_tweet)
"""